"ERROR_PARSE_FILENOTFOUND"="Не найдено ни одного файла, указанного для %s"
"ERROR_PARSE_OUTPUTPATH"="Неверно задан выходной файл/путь для %s"

"ERROR_IS7ZIP_FILESEEK"="Произошла ошибка позиционирования в файловом потоке в модуле IS7zipExtract!"
"ERROR_IS7ZIP_FILECREATE"="Произошла ошибка создания файлового потока%n%s%nв модуле IS7zipExtract!"
"ERROR_IS7ZIP_FILEOPEN"="Произошла ошибка открытия файлового потока%n%s%nв модуле IS7zipExtract!"
"ERROR_IS7ZIP_COLFILES"="Ошибка определения числа файлов в архиве в модуле IS7zipExtract!"
"ERROR_IS7ZIP_NOTOPEN"="Ошибка открытия архива в модуле IS7zipExtract!"
"ERROR_IS7ZIP_CORRUPT"="Ошибка извлечения данных из 7z-архива. Возможно он поврежден!"
"ERROR_IS7ZIP_EXCEPT"="Ошибка в архиве или непредвиденная ошибка в модуле IS7zipExtract!"

"ERROR_ISARC_LOADDLL"="Произошла ошибка при загрузке Unarc.dll!"
"ERROR_ISARC_GENERAL"="Произошла ошибка при распаковке!%nUnarc.dll вернул код ошибки: -1%n%s"
"ERROR_ISARC_INVALID_COMPRESSOR"="Произошла ошибка при распаковке: Неизвестный метод сжатия архива!%nUnarc.dll вернул код ошибки: -2%n%s"
"ERROR_ISARC_ONLY_DECOMPRESS"="Произошла ошибка при распаковке!%nUnarc.dll вернул код ошибки: -3%n%s"
"ERROR_ISARC_OUTBLOCK_TOO_SMALL"="Произошла ошибка при распаковке: Выходной блок данных слишком мал!%nUnarc.dll вернул код ошибки: -4%n%s"
"ERROR_ISARC_NOT_ENOUGH_MEMORY"="Произошла ошибка при распаковке: Не хватает памяти!%nUnarc.dll вернул код ошибки: -5%n%s"
"ERROR_ISARC_READ"="Произошла ошибка при распаковке: Невозможно считать данные!%nUnarc.dll вернул код ошибки: -6%n%s"
"ERROR_ISARC_BAD_COMPRESSED_DATA"="Произошла ошибка при распаковке: Архив поврежден!%nUnarc.dll вернул код ошибки: -7%n%s"
"ERROR_ISARC_NOT_IMPLEMENTED"="Произошла ошибка при распаковке: Необходимые функции не поддерживаются библиотекой!%nUnarc.dll вернул код ошибки: -8%n%s"
"ERROR_ISARC_NO_MORE_DATA_REQUIRED"="Произошла ошибка при распаковке: Запрошенные данные уже были распакованы!%nUnarc.dll вернул код ошибки: -9%n%s"
"ERROR_ISARC_WRITE"="Произошла ошибка при распаковке: Невозможно записать данные на диск!%nUnarc.dll вернул код ошибки: -11%n%s"
"ERROR_ISARC_BAD_CRC"="Произошла ошибка при распаковке: Не совпадает контрольная сумма!%nUnarc.dll вернул код ошибки: -12%n%s"
"ERROR_ISARC_BAD_PASSWORD"="Произошла ошибка при распаковке: Неверный пароль!%nUnarc.dll вернул код ошибки: -13%n%s"
"ERROR_ISARC_BAD_HEADERS"="Произошла ошибка при распаковке: Заголовок архива поврежден!%nUnarc.dll вернул код ошибки: -14%n%s"
"ERROR_ISARC_INTERNAL"="Произошла ошибка при распаковке: Внутренняя ошибка библиотеки!%nUnarc.dll вернул код ошибки: -15%n%s"
"ERROR_ISARC_UNKNOWN"="Произошла ошибка при распаковке!%n%s"
"ERROR_ISARC_EXCEPT"="Ошибка в архиве или непредвиденная ошибка в модуле ISArcExtract!"

"ERROR_ISPCF_CANT_OPEN_INFILE"="Произошла ошибка доступа к входному файлу%n%s%nв модуле ISPrecompExtract"
"ERROR_ISPCF_ISNOTPCF"="Неверный формат PCF-файла:%n%s"
"ERROR_ISPCF_UNKNOWN_VERSION"="Неизвестная версия PCF-файла:%n%s"
"ERROR_ISPCF_ACCESS_TO_OUTFILE"="В модуле ISPrecompExtract не удается получить доступ к выходному файлу:%n%s"
"ERROR_ISPCF_LAUNCH_PROC"="Ошибка запуска консольного приложения %s"
"WARNING_ISPCF_OPEN_PROC"="Ошибка при открытии процесса в ISPrecompExtract.%nВозможно у инсталлера недостаточно прав.%nПрогресс некоторых операций будет недоступен!"
"ERROR_ISPCF_CANT_FIND_OUTFILE"="Консольным приложением не был создан файл%n%s%nВозможно ошибка или неверный формат pcf-файла"
"ERROR_ISPCF_EXCEPT"="Возникла непредвиденная ошибка в модуле ISPrecompExtract!"

"ERROR_ISSREP_GENERAL"="Возникла ошибка в модуле ISSrepExtract!%n%s"
"ERROR_ISSREP_ACCESS_TO_OUTFILE"="В модуле ISSrepExtract не удается получить доступ к выходному файлу:%n%s"
"ERROR_ISSREP_EXCEPT"="Возникла непредвиденная ошибка в модуле ISSrepExtract!"

"ERROR_ISRAR_MULTIVOLUME"="многотомные .rar архивы с данными на разных дисках не поддерживаются!"
"ERROR_ISRAR_DLL_NOT_FOUND"="Не найдена библиотека %s"
"ERROR_ISRAR_EXCEPT"="Ошибка в архиве или непредвиденная ошибка в модуле ISRarExtract!"

"ERROR_M3PACK_ACCESS_TO_OUTFILE"="В модуле ISm3unpack не удается получить доступ к выходному файлу:%n%s"
"ERROR_M3PACK_EXCEPT"="Возникла непредвиденная ошибка в модуле ISm3unpack!"

"ERROR_UNPACK_ACCESS_TO_OUTFILE"="В модуле ISUnpack не удается получить доступ к выходному файлу:%n%s"
"ERROR_UNPACK_LAUNCH_PROC"="Ошибка запуска консольного приложения в ISUnpack!"
"WARNING_UNPACK_OPEN_PROC"="Ошибка при открытии процесса в ISUnpack.%nВозможно у инсталлера недостаточно прав.%nПрогресс некоторых операций будет недоступен!"
"ERROR_UNPACK_CANT_FIND_OUTFILE"="Консольным приложением не был создан файл%n%s%nВозможно ошибка или неверный формат unpack-файла"
"ERROR_UNPACK_EXCEPT"="Возникла непредвиденная ошибка в модуле ISUnpack!"

"ERROR_XDELTA_GENERAL"="Произошла ошибка распаковки в модуле ISxDeltaExtract!"
"ERROR_XDELTA_CANT_GET_MEM"="Ошибка при выделении ОЗУ для выполнния операции в ISxDeltaExtract!"
"ERROR_XDELTA_DLL_NOT_FOUND"="Не найдена библиотека %s"
"ERROR_XDELTA_ACCESS_TO_OUTFILE"="В модуле ISxDeltaExtract не удается получить доступ к выходному файлу:%n%s"
"ERROR_XDELTA_EXCEPT"="Возникла непредвиденная ошибка в модуле ISxDeltaExtract!"

"ERROR_PACKZIP_BAD_INFILE"="Неверно задан входной путь для ISPackZIP"
"ERROR_PACKZIP_BAD_OUTFILE"="Неверно задан выходной файл для ISPackZIP"
"ERROR_PACKZIP_BAD_COMPRESSION_LVL"="Параметр сжатия для ISPackZIP должен лежать в пределах 0..9"
"ERROR_PACKZIP_ACCESS_TO_OUTFILE"="В модуле ISPackZIP не удается получить доступ к выходному файлу:%n%s"
"ERROR_PACKZIP_LAUNCH_PROC"="Ошибка запуска консольного приложения %s"
"WARNING_PACKZIP_OPEN_PROC"="Ошибка при открытии процесса в ISPackZIP.%nВозможно у инсталлера недостаточно прав.%nПрогресс некоторых операций будет недоступен!"
"ERROR_PACKZIP_CANT_FIND_OUTFILE"="Консольным приложением не был создан файл%n%s%nв модуле ISPackZIP"
"ERROR_PACKZIP_EXCEPT"="Возникла непредвиденная ошибка в модуле ISPackZIP!"

"ERROR_INIT_LOW_MEM"="Недостаточно оперативной памяти для распаковки архивов!%nПопробуйте закрыть по возможности все запущенные программы%nи перезапустите инсталлер."
"ERROR_INIT_CANT_GET_MEM"="Ошибка выделения памяти при инициализации библиотеки!"
"WARNING_INIT_SREP_BAD_PARAM"="При инициализации srep указывайте значение не более 4096Мб.%nЧтобы не выводилось данное сообщение, поправьте соответствующий параметр."
"ERROR_INIT_PRECOMP_BAD_PARAM"="При инициализации неверно задана версия Precomp!"

"ERROR_FINFILES_EXCEPT"="Непредвиденная ошибка в модуле ISFindFiles!"
"ERROR_PICKFILE_EXCEPT"="Непредвиденная ошибка в модуле ISPickFilename!"
"ERROR_EXEC_LAUNCH_PROC"="Ошибка запуска%n%s%nв модуле ISExec!"
"ERROR_EXEC_EXCEPT"="Возникла непредвиденная ошибка в модуле ISExec!"

"CHANGE_DISK_TITLE"="Необходимо вставить следующий диск"
"CHANGE_DISK_LABEL"="Если файлы диска могут быть найдены в папке, отличающейся от показанной ниже, введите правильный путь или нажмите Обзор"
"BROWSE_TITLE"="Обзор папок"
"BROWSE_LABEL"="Пожалуйста, укажите путь к требуемому диску"
"BUTTON_OK"="ОК"
"BUTTON_CANCEL"="Отмена"
"BUTTON_BROWSE"="Обзор..."

"TIME_HOUR_SHORT"=" ч "
"TIME_MIN_SHORT"=" мин "
"TIME_SEC_SHORT1"=" сек"
"TIME_SEC_SHORT2"=" с"
"TIME_HOUR_FULL1"="часов "
"TIME_HOUR_FULL2"="час "
"TIME_HOUR_FULL3"="часа "
"TIME_MIN_FULL1"="минут "
"TIME_MIN_FULL2"="минута "
"TIME_MIN_FULL3"="минуты "
"TIME_SEC_FULL1"="секунд "
"TIME_SEC_FULL2"="секунда "
"TIME_SEC_FULL3"="секунды "
"TIME_TYPE1"="Осталось: "
"TIME_TYPE2"="Прошло: "
"TIME_TYPE3"="Всего: "
"TIME_TYPE4"="Жди "
"TIME_INFINITE"="вечность"
"TIME_TEST"="Тестовый прогон"
"GENERAL_ENDING"="Завершение..."
"GENERAL_DELETING"="Удаление временных файлов..."
"GENERAL_SCANNING"="Сканирование файлов..."
